simmsb/tyrfing/vendor/avr-device/svd/attiny828.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FUSE</name>
      <description>Fuses</description>
      <baseAddress>0x00000000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EXTENDED</name>
          <description>No Description.</description>
          <addressOffset>0x2</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOTRST</name>
              <description>Boot Reset vector Enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOTSZ</name>
              <description>Select boot size</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1024W_0C00</name>
                  <description>Boot Flash size=1024 words Boot address=$0C00</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512W_0E00</name>
                  <description>Boot Flash size=512 words Boot address=$0E00</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256W_0F00</name>
                  <description>Boot Flash size=256 words Boot address=$0F00</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128W_0F80</name>
                  <description>Boot Flash size=128 words Boot address=$0F80</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODACT</name>
              <description>BOD mode of operation when the device is active or idle</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOD_SAMPLED</name>
                  <description>Sampled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_ENABLED</name>
                  <description>Enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_DISABLED</name>
                  <description>Disabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BODPD</name>
              <description>BOD mode of operation when the device is in sleep mode</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BOD_SAMPLED</name>
                  <description>Sampled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_ENABLED</name>
                  <description>Enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOD_DISABLED</name>
                  <description>Disabled</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HIGH</name>
          <description>No Description.</description>
          <addressOffset>0x1</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BODLEVEL</name>
              <description>Brown-out Detector trigger level</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>4V3</name>
                  <description>Brown-out detection at VCC=4.3 V</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2V7</name>
                  <description>Brown-out detection at VCC=2.7 V</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1V8</name>
                  <description>Brown-out detection at VCC=1.8 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Brown-out detection disabled</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EESAVE</name>
              <description>Preserve EEPROM through the Chip Erase cycle</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTON</name>
              <description>Watch-dog Timer always on</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPIEN</name>
              <description>Serial program downloading (SPI) enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DWEN</name>
              <description>Debug Wire enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSTDISBL</name>
              <description>Reset Disabled (Enable PC6 as i/o pin)]</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LOW</name>
          <description>No Description.</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SUT_CKSEL</name>
              <description>Select Clock Source</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_0MS</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_0MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTULPOSC_32KHZ_6CK_14CK_0MS</name>
                  <description>Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 0 ms</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_4MS1</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_4MS1</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTULPOSC_32KHZ_6CK_14CK_4MS1</name>
                  <description>Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 4.1 ms</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTCLK_6CK_14CK_65MS</name>
                  <description>Ext. Clock; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTRCOSC_8MHZ_6CK_14CK_65MS</name>
                  <description>Int. RC Osc. 8 MHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTULPOSC_32KHZ_6CK_14CK_65MS</name>
                  <description>Int. ULP Osc. 32kHz; Start-up time PWRDWN/RESET: 6 + 14 CK + 65 ms</description>
                  <value>51</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKOUT</name>
              <description>Clock output on PORTB0</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CKDIV8</name>
              <description>Divide clock by 8 internally</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
