simmsb/tyrfing/vendor/avr-device/svd/attiny828.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WDT</name>
      <description>Watchdog Timer</description>
      <baseAddress>0x00000060</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WDTCSR</name>
          <description>Watchdog Timer Control and Status Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WDP</name>
              <description>Watchdog Timer Prescaler Bits</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_512_16_MS</name>
                  <description>Oscillator Cycles 512 (16 ms)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_1K_32_MS</name>
                  <description>Oscillator Cycles 1K (32 ms)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_2K_64_MS</name>
                  <description>Oscillator Cycles 2K (64 ms)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_4K_0_125_S</name>
                  <description>Oscillator Cycles 4K (0.125 s)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_8K_0_25_S</name>
                  <description>Oscillator Cycles 8K (0.25 s)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_16K_0_5_S</name>
                  <description>Oscillator Cycles 16K (0.5 s)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_32K_1_0_S</name>
                  <description>Oscillator Cycles 32K (1.0 s)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCILLATOR_CYCLES_64K_2_0_S</name>
                  <description>Oscillator Cycles 64K (2.0 s)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDE</name>
              <description>Watch Dog Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Timer Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WDIF</name>
              <description>Watchdog Timer Interrupt Flag</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>